Merge pull request #9 from alehardmode/phase3
